<a href="https://colab.research.google.com/github/Ozah-Blessing/Hamoye_Quiz_Answer/blob/main/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## **CREATING series in pandas **

In [ ]:
import pandas as pd
days=pd.Series(['Monday','Tuesday','Wednesday'])
print(days)

0       Monday
1      Tuesday
2    Wednesday
dtype: object

# USING STRINGS AS INDEX

In [ ]:
days=pd.Series(['Monday','Tuesday','Wednesday'])
index=['a','b','c']
days1=pd.Series({'a':'Monday','b':'Tuesday','c':'Wednesday'})
print(days)
print()
print(days1)

0       Monday
1      Tuesday
2    Wednesday
dtype: object

a       Monday
b      Tuesday
c    Wednesday
dtype: object

In [ ]:
days[0]

'Monday'

In [ ]:
days[1:]

1      Tuesday
2    Wednesday
dtype: object

In [ ]:
days1['c']

'Wednesday'

# CREATING SERIES IN NUMPY ARRAY

In [ ]:
import numpy as np

days_list=np.array(['Monday','Tuesday', 'Wednesday'])
numpy_days=pd.Series(days_list)
print(numpy_days)

0       Monday
1      Tuesday
2    Wednesday
dtype: object

**DATAFRAMES**

# Creating a dataframe from a dictionary

In [ ]:
df_dict={'Country':['Ghana','Kenya','Nigeria','Togo'],
         'Capital':['Accra','Nairobi','Abuja','Lome'],
         'Population':[10000,8500,35000,12000],
         'Age':[60,70,80,75]}
df=pd.DataFrame(df_dict,index=[2,4,6,8])   
df

   Country  Capital  Population  Age
2    Ghana    Accra       10000   60
4    Kenya  Nairobi        8500   70
6  Nigeria    Abuja       35000   80
8     Togo     Lome       12000   75

# RETRIEVING DATA IN DATAFRAME USIING at, iat, iloc and loc

# selcect row at index 3 usingiloc
iloc uses integer index positions

In [ ]:
df.iloc[3]

Country        Togo
Capital        Lome
Population    12000
Age              75
Name: 8, dtype: object

#Select row at index 2

In [ ]:
df.iloc[2]

Country       Nigeria
Capital         Abuja
Population       3500
Age                80
Name: 6, dtype: object

# loc selet rows or colounm using labels

In [ ]:
df.loc[2]

Country       Ghana
Capital       Accra
Population    10000
Age              60
Name: 2, dtype: object

In [ ]:
df.loc[8]

Country        Togo
Capital        Lome
Population    12000
Age              75
Name: 8, dtype: object

In [ ]:
df['Capital']

2      Accra
4    Nairobi
6      Abuja
8       Lome
Name: Capital, dtype: object

In [ ]:
df.at[6, 'Country']

'Nigeria'

In [ ]:
df.iat[2,0]

'Nigeria'

In [ ]:
df['Population'].sum()

65500

In [ ]:
df.mean()

Population    16375.00
Age              71.25
dtype: float64

In [ ]:
df.describe()

         Population        Age
count      4.000000   4.000000
mean   16375.000000  71.250000
std    12499.166639   8.539126
min     8500.000000  60.000000
25%     9625.000000  67.500000
50%    11000.000000  72.500000
75%    17750.000000  76.250000
max    35000.000000  80.000000

# MISSING DATA

In [ ]:
df_dict2={'Name':['James','Bola','Blessing',np.nan],
          'Profession':['Researcher','Artist','Doctor','Writer'],
          'Experience':[12,np.nan,10,18],
          'Height':[np.nan, 175, 180, 150]}
new_df=pd.DataFrame(df_dict2)  
new_df

       Name  Profession  Experience  Height
0     James  Researcher        12.0     NaN
1      Bola      Artist         NaN   175.0
2  Blessing      Doctor        10.0   180.0
3       NaN      Writer        18.0   150.0

In [ ]:
new_df.isnull()

    Name  Profession  Experience  Height
0  False       False       False    True
1  False       False        True   False
2  False       False       False   False
3   True       False       False   False

In [ ]:
new_df.dropna()

       Name Profession  Experience  Height
2  Blessing     Doctor        10.0   180.0

In [ ]:
new_df.notnull()

    Name  Profession  Experience  Height
0   True        True        True   False
1   True        True       False    True
2   True        True        True    True
3  False        True        True    True

In [ ]:
new_df.replace()

       Name  Profession  Experience  Height
0     James  Researcher        12.0     NaN
1      Bola      Artist        12.0   175.0
2  Blessing      Doctor        10.0   180.0
3  Blessing      Writer        18.0   150.0